# Checking for Duplicates in csv  file

In [1]:
import pandas as pd

## Importing the required csv file

In [2]:
df1 = pd.read_csv("G:\student.csv")
df1

      Name  Maths  Science
0    Rohit     98       94
1  Saurabh     92       91
2   Kushal     99       94
3     Abhi     88       82
4  Avinash     73       78
5    Rohit     97       92
6  Saurabh     91       92
7   Kushal     88       79
8    Rohit     98       94

## Checking for Duplicate Names in file if any

### df.duplicated()

This gives us a list of duplicate values . We will view them as dataframe .

In [3]:
duplicates = df1[df1.duplicated(subset='Name')]
duplicates

      Name  Maths  Science
5    Rohit     97       92
6  Saurabh     91       92
7   Kushal     88       79
8    Rohit     98       94

## Removing Duplicate names in the file.

### df.drop_duplicates(keep = 'first')
This removes all duplicate values by keeping the first one as original as gives a new dataframe.

In [4]:
df2 = df1.drop_duplicates(subset='Name' , keep = 'first')
df2

      Name  Maths  Science
0    Rohit     98       94
1  Saurabh     92       91
2   Kushal     99       94
3     Abhi     88       82
4  Avinash     73       78